# Display all header tags from wikepedia.org

In [1]:
!pip install bs4
!pip install requests

Requirement already satisfied: bs4 in c:\users\poovi\anaconda3\lib\site-packages (0.0.1)
Requirement already satisfied: beautifulsoup4 in c:\users\poovi\anaconda3\lib\site-packages (from bs4) (4.10.0)
Requirement already satisfied: soupsieve>1.2 in c:\users\poovi\anaconda3\lib\site-packages (from beautifulsoup4->bs4) (2.2.1)
Requirement already satisfied: requests in c:\users\poovi\anaconda3\lib\site-packages (2.26.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\poovi\anaconda3\lib\site-packages (from requests) (3.2)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\poovi\anaconda3\lib\site-packages (from requests) (1.26.7)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\poovi\anaconda3\lib\site-packages (from requests) (2021.10.8)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\poovi\anaconda3\lib\site-packages (from requests) (2.0.4)

In [2]:
#import libraries

from bs4 import BeautifulSoup
import requests

In [3]:
#send get request to webpage server to get source page
page = requests.get('https://www.wikipedia.org/')
page

In [4]:
#Page Content
soup = BeautifulSoup(page.content)

In [5]:
#scraping all the header tags

header = []  #empty list
#append headers to list
for i in soup.find_all('span',class_="other-project-title jsl10n"):
    header.append(i.text)
header   #displaying all header

['Commons',
 'Wikivoyage',
 'Wiktionary',
 'Wikibooks',
 'Wikinews',
 'Wikidata',
 'Wikiversity',
 'Wikiquote',
 'MediaWiki',
 'Wikisource',
 'Wikispecies',
 'Meta-Wiki']

# IMBD's Top rated 100 movies

In [6]:
#importing libraries
from bs4 import BeautifulSoup
import requests

In [7]:
#send get request to web page server to get source page
page = requests.get('https://www.imdb.com/chart/top/?ref_=nv_mv_250')
page

In [8]:
#page content
soup = BeautifulSoup(page.content)

In [9]:
#Scraping Movie names
names = []  #empty list
#append movie_name to list
for i in soup.find_all('td',class_='titleColumn')[:100]:
    names.append(i.text.replace("\n",""))

In [10]:
#Scraping year of release

year = []
specialchar = ""
#append year of release to list
for i in soup('span',class_="secondaryInfo")[:100]:
    tmp_year = i.text.replace('(',"")  #replacing '(' with ""
    tmp_year = tmp_year.replace(')',"")#replacing ')' with ""
    year.append(tmp_year)

In [11]:
#scraping rating of each movie

ratings = []
#append rating of movie to list
for i in soup.find_all('td',class_="ratingColumn imdbRating")[:100]:
    ratings.append(i.text.replace("\n",""))

In [12]:
print(len(names),len(year),len(ratings))  #printing length of names,year,ratings

100 100 100

In [13]:
#Making DataFrame
import pandas as pd
df = pd.DataFrame({'movie_name':names,'year':year,'imdb_rating':ratings})
df

                                           movie_name  year imdb_rating
0              1.      The Shawshank Redemption(1994)  1994         9.2
1                         2.      The Godfather(1972)  1972         9.2
2                       3.      The Dark Knight(2008)  2008         9.0
3                4.      The Godfather: Part II(1974)  1974         9.0
4                          5.      12 Angry Men(1957)  1957         8.9
..                                                ...   ...         ...
95        96.      M - Eine Stadt sucht einen Mörd...  1931         8.3
96                  97.      North by Northwest(1959)  1959         8.3
97                              98.      Jagten(2012)  2012         8.3
98                             99.      Vertigo(1958)  1958         8.2
99        100.      Le fabuleux destin d'Amélie Po...  2001         8.2

[100 rows x 3 columns]

# Top Rated 100 Indian Movies

In [14]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [15]:
#send get request to source page
page = requests.get('https://www.imdb.com/india/top-rated-indian-movies/')
page

In [16]:
#Page Content
soup = BeautifulSoup(page.content)

In [17]:
#scraping movie name

movie = []
#append movie name to list
for i in soup.find_all('td',class_="titleColumn")[:100]:
    movie.append(i.text.replace('\n',""))

In [18]:
#scraping year of release
year = []
#append year of release to list
for i in soup.find_all('span',class_="secondaryInfo")[:100]:
    tmp_year = i.text.replace('(',"")
    tmp_year = tmp_year.replace(')',"")
    year.append(tmp_year)

In [19]:
#scraping movie ratings
ratings = []
#append rating to list
for i in soup.find_all('td',class_="ratingColumn imdbRating")[:100]:
    ratings.append(i.text.replace('\n',""))

In [20]:
#DataFrame
import pandas as pd
df = pd.DataFrame({'movie_name':movie,'year':year,'imbd_rating':ratings})
df

                                       movie_name  year imbd_rating
0                  1.      K.G.F: Chapter 2(2022)  2022         8.4
1                        2.      Anbe Sivam(2003)  2003         8.4
2                          3.      Jai Bhim(2021)  2021         8.4
3                           4.      Golmaal(1979)  1979         8.4
4                           5.      Nayakan(1987)  1987         8.4
..                                            ...   ...         ...
95                          96.      Baasha(1995)  1995         8.0
96                          97.      Masaan(2015)  2015         8.0
97                  98.      Dil Chahta Hai(2001)  2001         8.0
98                         99.      Kahaani(2012)  2012         8.0
99        100.      Maheshinte Prathikaaram(2016)  2016         8.0

[100 rows x 3 columns]

# Meesho

In [21]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [22]:
#send get request to source page
page = requests.get('https://meesho.com/bags-ladies/pl/p7vbp')
page

In [23]:
#page content
soup = BeautifulSoup(page.content)

In [24]:
#Getting bag names
product_names = []
#append bag name to list
for i in soup.find_all('p',class_="Text__StyledText-sc-oo0kvp-0 bWSOET NewProductCard__ProductTitle_Desktop-sc-j0e7tu-4 cQhePS NewProductCard__ProductTitle_Desktop-sc-j0e7tu-4 cQhePS"):
    product_names.append(i.text)

In [25]:
#Getting price
price = []
#append price to list
for i in soup.find_all('h5',class_="Text__StyledText-sc-oo0kvp-0 hiHdyy"):
    price.append(i.text.replace('₹',""))

In [26]:
#Getting discount
discount = []
#append discount to list
for i in soup.find_all('span',class_="Text__StyledText-sc-oo0kvp-0 lnonyH"):
    discount.append(i.text.replace('off',""))

In [27]:
print(len(product_names),len(price),len(discount))

16 16 16

In [28]:
#DataFrame
import pandas as pd
df = pd.DataFrame({'product_names':product_names,'price':price,'discount':discount})
df

                           product_names price discount
0      Ravishing Alluring Women Handbags   384     12%
1          Graceful Fancy Women Handbags   528      9%
2        Ravishing Classy Women Handbags   950      5%
3       Classic Versatile Women Handbags   950      5%
4           Voguish Fancy Women Handbags  1549      3%
5      Graceful Versatile Women Handbags   950      5%
6         Classic Stylish Women Handbags  3202      2%
7   Ravishing Fashionable Women Handbags   316     14%
8          Elegant Classy Women Handbags   950      5%
9        Elegant Alluring Women Handbags  2337      2%
10       Classic Alluring Women Handbags   518      9%
11    Elegant Fashionable Women Handbags   725      6%
12        Trendy Alluring Women Handbags  1320      4%
13        Trendy Alluring Women Handbags   950      5%
14          Classic Fancy Women Handbags   646      7%
15    Classic Fashionable Women Handbags   620      7%

# ICC Cricket

# Top 10 Men's ODI teams

In [29]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [30]:
#send get request to source page 
page = requests.get('https://www.icc-cricket.com/rankings/mens/team-rankings/odi')
page

In [31]:
#page content
soup = BeautifulSoup(page.content)

In [32]:
#scraping team names
country = []
#append team name to list
for i in soup.find_all('span',class_="u-hide-phablet")[:10]:
    country.append(i.text)

In [33]:
match = soup.find('td',class_="rankings-block__banner--matches") #getting 1st match number
point = soup.find('td',class_="rankings-block__banner--points")  #getting first points
match.text,point.text

('20', '2,448')

In [34]:
matches = []
temp = []
j = 0
#soup.find_all returns match and points to different line of list,for loop appends match and points to a single list
for i in soup.find_all('td',class_="table-body__cell u-center-text")[:18]:
    temp.append(i.text)
    if((j%2)!=0):
        matches.append(temp)
        temp = []
    j = j+1
matches

[['32', '3,793'],
 ['31', '3,475'],
 ['38', '4,162'],
 ['31', '3,167'],
 ['30', '2,921'],
 ['36', '3,350'],
 ['35', '2,835'],
 ['36', '2,788'],
 ['23', '1,562']]

In [35]:
#DataFrame
import pandas as pd
df = pd.DataFrame(matches)
df.columns = ['matches','points']
df

  matches points
0      32  3,793
1      31  3,475
2      38  4,162
3      31  3,167
4      30  2,921
5      36  3,350
6      35  2,835
7      36  2,788
8      23  1,562

In [36]:
df1 = pd.DataFrame({'matches':20,'points':2448},index=[0])
#concatinating df and df1
df2 = pd.concat([df1,df],ignore_index=True)
df2

  matches points
0      20   2448
1      32  3,793
2      31  3,475
3      38  4,162
4      31  3,167
5      30  2,921
6      36  3,350
7      35  2,835
8      36  2,788
9      23  1,562

In [37]:
#getting first value of rating
rate = soup.find('td',class_="rankings-block__banner--rating u-text-right")
rate.text.replace('\n',"")

'                            122                            '

In [38]:
rating = []
#append all rating values to list
for i in soup.find_all('td',class_="table-body__cell u-text-right rating")[:9]:
    rating.append(i.text)
rating

['119', '112', '110', '102', '97', '93', '81', '77', '68']

In [39]:
#insert the 1st rate value to rating list
rating.insert(0,'122')
rating

['122', '119', '112', '110', '102', '97', '93', '81', '77', '68']

In [40]:
#DataFrame
import pandas as pd
df1 = pd.DataFrame({'Team':country,'rating':rating})
df1

           Team rating
0   New Zealand    122
1       England    119
2     Australia    112
3         India    110
4  South Africa    102
5      Pakistan     97
6    Bangladesh     93
7     Sri Lanka     81
8   West Indies     77
9   Afghanistan     68

In [41]:
#Concatenating df1 and df2
col = pd.concat([df1,df2],axis=1)
col

           Team rating matches points
0   New Zealand    122      20   2448
1       England    119      32  3,793
2     Australia    112      31  3,475
3         India    110      38  4,162
4  South Africa    102      31  3,167
5      Pakistan     97      30  2,921
6    Bangladesh     93      36  3,350
7     Sri Lanka     81      35  2,835
8   West Indies     77      36  2,788
9   Afghanistan     68      23  1,562

# Top 10 ODI Batsman Team and Ranking

In [42]:
#get request from the source page
page = requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi')
page

In [43]:
#page content
soup = BeautifulSoup(page.content)

In [44]:
#getting 1st player name in the list
player = soup.find('div',class_="rankings-block__banner--name")
player.text

'Babar Azam'

In [45]:
players = []
#append other player names to the list using for loop
for i in soup.find_all('td',class_="table-body__cell name")[:9]:
    players.append(i.text.replace('\n',""))

In [46]:
#insert the first player name to the players list
players.insert(0,'Babar Azam')
players

['Babar Azam',
 'Virat Kohli',
 'Imam-ul-Haq',
 'Rohit Sharma',
 'Quinton de Kock',
 'Jonny Bairstow',
 'Ross Taylor',
 'Rassie van der Dussen',
 'David Warner',
 'Aaron Finch']

In [47]:
#getting first country to the list
country = soup.find('div',class_="rankings-block__banner--nationality")
country.text.replace('\n',"")

'PAK                            891'

In [48]:
countries = []
#append countries to list
for i in soup.find_all('span',class_="table-body__logo-text")[:9]:
    countries.append(i.text)
countries

['IND', 'PAK', 'IND', 'SA', 'ENG', 'NZ', 'SA', 'AUS', 'AUS']

In [49]:
#insert 1st country name to countries list
countries.insert(0,'PAK')
countries

['PAK', 'IND', 'PAK', 'IND', 'SA', 'ENG', 'NZ', 'SA', 'AUS', 'AUS']

In [50]:
ratings = []
#append ratings to list
for i in soup.find_all('td',class_="table-body__cell u-text-right rating")[:9]:
    ratings.append(i.text)
ratings

['811', '795', '791', '789', '775', '775', '769', '750', '745']

In [51]:
#insert 1st rate to ratings list
ratings.insert(0,'891')
ratings

['891', '811', '795', '791', '789', '775', '775', '769', '750', '745']

In [52]:
#DataFrame
import pandas as pd
df = pd.DataFrame({'players':players,'country':countries,'ratings':ratings})
df

                 players country ratings
0             Babar Azam     PAK     891
1            Virat Kohli     IND     811
2            Imam-ul-Haq     PAK     795
3           Rohit Sharma     IND     791
4        Quinton de Kock      SA     789
5         Jonny Bairstow     ENG     775
6            Ross Taylor      NZ     775
7  Rassie van der Dussen      SA     769
8           David Warner     AUS     750
9            Aaron Finch     AUS     745

# Top 10 ODI Bowlers

In [53]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [54]:
#get request from source page
page = requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling')
page

In [55]:
#page content
soup = BeautifulSoup(page.content)

In [56]:
#getting 1st bowler name to list
bowler = soup.find('div',class_="rankings-block__banner--name-large")
bowler.text

'Trent Boult'

In [57]:
bowlers = []
#append bowlers name to list
for i in soup.find_all('td',class_="table-body__cell rankings-table__name name")[:9]:
    bowlers.append(i.text.replace('\n',""))

In [58]:
#insert 1st bowler name to bowlers list
bowlers.insert(0,'Trent Boult')
bowlers

['Trent Boult',
 'Chris Woakes',
 'Josh Hazlewood',
 'Matt Henry',
 'Mujeeb Ur Rahman',
 'Jasprit Bumrah',
 'Shaheen Afridi',
 'Mehedi Hasan',
 'Shakib Al Hasan',
 'Rashid Khan']

In [59]:
#get 1st country name to list
country = soup.find('div',class_="rankings-block__banner--nationality")
country.text.replace('\n',"")

'NZ                    '

In [60]:
countries = []
#append country names to list
for i in soup.find_all('span',class_="table-body__logo-text")[:9]:
    countries.append(i.text)
countries

['ENG', 'AUS', 'NZ', 'AFG', 'IND', 'PAK', 'BAN', 'BAN', 'AFG']

In [61]:
#insert 1st country name to countries list
countries.insert(0,'NZ')
countries

['NZ', 'ENG', 'AUS', 'NZ', 'AFG', 'IND', 'PAK', 'BAN', 'BAN', 'AFG']

In [62]:
#get rate to list
rate = soup.find('div',class_="rankings-block__banner--rating")
rate.text

'726'

In [63]:
ratings = []
#append ratings to list
for i in soup.find_all('td',class_="table-body__cell rating")[:9]:
    ratings.append(i.text)
ratings

['700', '698', '683', '681', '679', '671', '661', '657', '650']

In [64]:
#insert 1st rate to ratings list
ratings.insert(0,'726')
ratings

['726', '700', '698', '683', '681', '679', '671', '661', '657', '650']

In [65]:
#DataFrame
import pandas as pd
df = pd.DataFrame({'bowlers':bowlers,'countries':countries,'ratings':ratings})
df

            bowlers countries ratings
0       Trent Boult        NZ     726
1      Chris Woakes       ENG     700
2    Josh Hazlewood       AUS     698
3        Matt Henry        NZ     683
4  Mujeeb Ur Rahman       AFG     681
5    Jasprit Bumrah       IND     679
6    Shaheen Afridi       PAK     671
7      Mehedi Hasan       BAN     661
8   Shakib Al Hasan       BAN     657
9       Rashid Khan       AFG     650

# Women's ODI

In [66]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [67]:
#get request from source page
page = requests.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')
page

In [68]:
#page content
soup = BeautifulSoup(page.content)

In [69]:
country = []
#append country to list
for i in soup.find_all('span',class_="u-hide-phablet")[:10]:
    country.append(i.text)
country

['Australia',
 'South Africa',
 'England',
 'India',
 'New Zealand',
 'West Indies',
 'Bangladesh',
 'Pakistan',
 'Ireland',
 'Sri Lanka']

In [70]:
#get 1st match number to list
match = soup.find('td',class_="rankings-block__banner--matches")
match.text

'29'

In [71]:
#get 1st point to list
point = soup.find('td',class_="rankings-block__banner--points")
point.text

'4,840'

In [72]:
matches = []
temp = []
j = 0
#match and points are in different list, using for loop it is converted to single list
for i in soup.find_all('td',class_="table-body__cell u-center-text")[:18]:
    temp.append(i.text)
    if ((j % 2) != 0):
        matches.append(temp)
        temp =[]
    j = j+1
matches

[['28', '3,504'],
 ['30', '3,533'],
 ['29', '2,878'],
 ['31', '3,030'],
 ['28', '2,481'],
 ['12', '936'],
 ['26', '1,752'],
 ['5', '240'],
 ['5', '233']]

In [73]:
#dataframe for match and points
df = pd.DataFrame(data=matches,columns=['matches','points'])
df

  matches points
0      28  3,504
1      30  3,533
2      29  2,878
3      31  3,030
4      28  2,481
5      12    936
6      26  1,752
7       5    240
8       5    233

In [74]:
df1 = pd.DataFrame({'matches':29,'points':4840},index=[0])

In [75]:
#concatenating df1 and df
df2 = pd.concat([df1,df],ignore_index=True)
df2

  matches points
0      29   4840
1      28  3,504
2      30  3,533
3      29  2,878
4      31  3,030
5      28  2,481
6      12    936
7      26  1,752
8       5    240
9       5    233

In [76]:
#getting 1st rate to list
rate = soup.find('td',class_="rankings-block__banner--rating u-text-right")
rate.text.replace('\n',"")

'                            167                            '

In [77]:
ratings = []
#append rates to list
for i in soup.find_all('td',class_="table-body__cell u-text-right rating")[:9]:
    ratings.append(i.text)
ratings

['125', '118', '99', '98', '89', '78', '67', '48', '47']

In [78]:
#inserting first rate to rating list
ratings.insert(0,'167')
ratings

['167', '125', '118', '99', '98', '89', '78', '67', '48', '47']

In [79]:
#dataframe fro Team and rating
df3 = pd.DataFrame({'Team':country,'ratings':ratings})
df3

           Team ratings
0     Australia     167
1  South Africa     125
2       England     118
3         India      99
4   New Zealand      98
5   West Indies      89
6    Bangladesh      78
7      Pakistan      67
8       Ireland      48
9     Sri Lanka      47

In [80]:
#concatinating to df3 and df2 to get the final result
pd.concat([df3,df2],axis=1)

           Team ratings matches points
0     Australia     167      29   4840
1  South Africa     125      28  3,504
2       England     118      30  3,533
3         India      99      29  2,878
4   New Zealand      98      31  3,030
5   West Indies      89      28  2,481
6    Bangladesh      78      12    936
7      Pakistan      67      26  1,752
8       Ireland      48       5    240
9     Sri Lanka      47       5    233

# Women's ODI Batting Players

In [81]:
#get request from source page
page = requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting')
page

In [82]:
#page content
soup = BeautifulSoup(page.content)

In [83]:
#getting 1st name to list
name = soup.find('div',class_="rankings-block__banner--name-large")
name.text

'Alyssa Healy'

In [84]:
names = []
#append other player names to list
for i in soup.find_all('td',class_="table-body__cell rankings-table__name name")[:9]:
    names.append(i.text.replace("\n",""))

In [85]:
#inserting 1st player name to other players in the list
names.insert(0,'Alyssa Healy')
names

['Alyssa Healy',
 'Natalie Sciver',
 'Beth Mooney',
 'Laura Wolvaardt',
 'Meg Lanning',
 'Rachael Haynes',
 'Mithali Raj',
 'Amy Satterthwaite',
 'Smriti Mandhana',
 'Tammy Beaumont']

In [86]:
#getting 1st country in the list
country = soup.find('div',class_="rankings-block__banner--nationality")
country.text.replace('\n','')

'AUS                    '

In [87]:
team = []
#append teams to list
for i in soup.find_all('span',class_="table-body__logo-text")[:9]:
    team.append(i.text)
team

['ENG', 'AUS', 'SA', 'AUS', 'AUS', 'IND', 'NZ', 'IND', 'ENG']

In [88]:
#inserting 1st team name to team list
team.insert(0,'AUS')
team

['AUS', 'ENG', 'AUS', 'SA', 'AUS', 'AUS', 'IND', 'NZ', 'IND', 'ENG']

In [89]:
#getting first rate name
rate = soup.find('div',class_="rankings-block__banner--rating")
rate.text

'785'

In [90]:
rating = []
#append ratings to list
for i in soup.find_all('td',class_="table-body__cell rating")[:9]:
    rating.append(i.text)
rating

['750', '748', '722', '710', '701', '686', '681', '669', '659']

In [91]:
#insert 1st rate to rating list
rating.insert(0,'785')
rating

['785', '750', '748', '722', '710', '701', '686', '681', '669', '659']

In [92]:
#DataFrame
import pandas as pd
df = pd.DataFrame({'names':names,'team':team,'rating':rating})
df

               names team rating
0       Alyssa Healy  AUS    785
1     Natalie Sciver  ENG    750
2        Beth Mooney  AUS    748
3    Laura Wolvaardt   SA    722
4        Meg Lanning  AUS    710
5     Rachael Haynes  AUS    701
6        Mithali Raj  IND    686
7  Amy Satterthwaite   NZ    681
8    Smriti Mandhana  IND    669
9     Tammy Beaumont  ENG    659

# Women's ODI All Rounder

In [93]:
#get request from source page
page = requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder')
page

In [94]:
#page content
soup = BeautifulSoup(page.content)

In [95]:
#getting 1st name to list
name = soup.find('div',class_="rankings-block__banner--name-large")
name.text

'Natalie Sciver'

In [96]:
names = []
#append names to list
for i in soup.find_all('td',class_="table-body__cell rankings-table__name name")[:9]:
    names.append(i.text.replace('\n',""))

In [97]:
#inserting 1st name to names list
names.insert(0,'Natalie Sciver')
names

['Natalie Sciver',
 'Ellyse Perry',
 'Marizanne Kapp',
 'Hayley Matthews',
 'Amelia Kerr',
 'Ashleigh Gardner',
 'Deepti Sharma',
 'Jess Jonassen',
 'Katherine Brunt',
 'Jhulan Goswami']

In [98]:
#append 1st team to list
team = soup.find('div',class_="rankings-block__banner--nationality")
team.text.replace('\n',"")

'ENG                    '

In [99]:
teams = []
#append teams to list
for i in soup.find_all('span',class_="table-body__logo-text")[:9]:
    teams.append(i.text)
teams

['AUS', 'SA', 'WI', 'NZ', 'AUS', 'IND', 'AUS', 'ENG', 'IND']

In [100]:
#insert 1st team to teams list
teams.insert(0,'ENG')
teams

['ENG', 'AUS', 'SA', 'WI', 'NZ', 'AUS', 'IND', 'AUS', 'ENG', 'IND']

In [101]:
#get 1st rate to list
rate = soup.find('div',class_="rankings-block__banner--rating")
rate.text

'393'

In [102]:
ratings = []
#append rating to list
for i in soup.find_all('td',class_="table-body__cell rating")[:9]:
    ratings.append(i.text)
ratings

['374', '359', '338', '335', '269', '249', '245', '221', '217']

In [103]:
#insert 1st rate to ratings list
ratings.insert(0,'393')
ratings

['393', '374', '359', '338', '335', '269', '249', '245', '221', '217']

In [104]:
#Making DataFrame
import pandas as pd
df = pd.DataFrame({'player':names,'teams':teams,'ratings':ratings})
df

             player teams ratings
0    Natalie Sciver   ENG     393
1      Ellyse Perry   AUS     374
2    Marizanne Kapp    SA     359
3   Hayley Matthews    WI     338
4       Amelia Kerr    NZ     335
5  Ashleigh Gardner   AUS     269
6     Deepti Sharma   IND     249
7     Jess Jonassen   AUS     245
8   Katherine Brunt   ENG     221
9    Jhulan Goswami   IND     217

# COREYMS.COM

In [105]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [106]:
#get request from source page
page = requests.get('https://coreyms.com/')
page

In [107]:
#page content
soup = BeautifulSoup(page.content)

In [108]:
#Scraping Heading
heading = []
#append heading to list
for i in soup.find_all('a',class_="entry-title-link"):
    heading.append(i.text)

In [109]:
#Scraping Date
date = []
#append data to list
for i in soup.find_all('time',class_="entry-time"):
    date.append(i.text)

In [110]:
#scraping content
content = []
#append content to list
for i in soup.find_all('div',class_="entry-content"):
    content.append(i.text.replace("\n",""))

In [111]:
#scraping video link
video = []
#append video_link to list
for i in soup.find_all('iframe',class_="youtube-player"):
    video.append(i['src'])

In [112]:
video.insert(4,'No Video')

In [113]:
print(len(heading),len(date),len(content),len(video))

10 10 10 10

In [114]:
#making dataframe
import pandas as pd
df = pd.DataFrame({'heading':heading,'date':date,'content':content,"video_link":video})
df

,heading,date,content,video_link
0,Python Tutorial: Zip Files – Creating and Extr...,"November 19, 2019","In this video, we will be learning how to crea...",https://www.youtube.com/embed/z0gguhEmWiY?vers...
1,Python Data Science Tutorial: Analyzing the 20...,"October 17, 2019","In this Python Programming video, we will be l...",https://www.youtube.com/embed/_P7X8tMplsw?vers...
2,Python Multiprocessing Tutorial: Run Code in P...,"September 21, 2019","In this Python Programming video, we will be l...",https://www.youtube.com/embed/fKl2JW_qrso?vers...
3,Python Threading Tutorial: Run Code Concurrent...,"September 12, 2019","In this Python Programming video, we will be l...",https://www.youtube.com/embed/IEEhzQoKtQU?vers...
4,Update (2019-09-03),"September 3, 2019",Hey everyone. I wanted to give you an update o...,No Video
5,Python Quick Tip: The Difference Between “==” ...,"August 6, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/mO_dS3rXDIs?vers...
6,Python Tutorial: Calling External Commands Usi...,"July 24, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/2Fp1N6dof0Y?vers...
7,Visual Studio Code (Windows) – Setting up a Py...,"May 1, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/-nh9rCzPJ20?vers...
8,Visual Studio Code (Mac) – Setting up a Python...,"May 1, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/06I63_p-2A4?vers...
9,Clarifying the Issues with Mutable Default Arg...,"April 24, 2019","In this Python Programming Tutorial, we will b...",https://www.youtube.com/embed/_JGmemuINww?vers...

# No Broker

In [115]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [116]:
#get request from source page
page = requests.get('https://www.nobroker.in/property/sale/bangalore/multiple?searchParam=W3sibGF0IjoxMi45NzgzNjkyLCJsb24iOjc3LjY0MDgzNTYsInBsYWNlSWQiOiJDaElKa1FOM0dLUVdyanNSTmhCUUpyaEdEN1UiLCJwbGFjZU5hbWUiOiJJbmRpcmFuYWdhciJ9LHsibGF0IjoxMi45OTgxNzMyLCJsb24iOjc3LjU1MzA0NDU5OTk5OTk5LCJwbGFjZUlkIjoiQ2hJSnhmVzREUE05cmpzUktzTlRHLTVwX1FRIiwicGxhY2VOYW1lIjoiUmFqYWppbmFnYXIifSx7ImxhdCI6MTIuOTMwNzczNSwibG9uIjo3Ny41ODM4MzAyLCJwbGFjZUlkIjoiQ2hJSjJkZGxaNWdWcmpzUmgxQk9BYWYtb3JzIiwicGxhY2VOYW1lIjoiSmF5YW5hZ2FyIn1d&radius=2.0&city=bangalore&locality=Indiranagar,&locality=Rajajinagar,&locality=Jayanagar')
page

In [117]:
#page content
soup = BeautifulSoup(page.content)

In [118]:
#scraping house name
house_name = []
#append house_name to list
for i in soup.find_all('span',class_="overflow-hidden overflow-ellipsis whitespace-nowrap max-w-80pe po:max-w-full"):
    house_name.append(i.text)

In [119]:
# scraping area,location
area = []
#append area to list
for i in soup.find_all('div',class_="mt-0.5p overflow-hidden overflow-ellipsis whitespace-nowrap max-w-70 text-gray-light leading-4 po:mb-0 po:max-w-95"):
    area.append(i.text)

In [120]:
#scraping emi
emi = []
emi_extract = []
#append emi to list
for i in soup.find_all('div',class_="flex flex-col w-33pe items-center border-r border-r-solid border-card-overview-border-color tp:w-half po:w-full last:border-r-1"):
    emi.append(i.text.replace('/MonthEstimated EMI',""))
#getting only the specified list values
for i in range(1,len(emi),2):
    emi_extract.append(emi[i])

In [121]:
#scraping price
price = []
#append price to list
for i in soup.find_all('div',class_="flex flex-col w-33pe items-center bo tp:w-half po:w-full border-r-0"):
    price.append(i.text)

In [122]:
print(len(house_name),len(area),len(emi_extract),len(price))

25 25 25 25

In [123]:
#Making DataFrame
import pandas as pd
df = pd.DataFrame({'House_name':house_name,'Area':area,'Monthly_emi':emi_extract,'Price':price})
df

,House_name,Area,Monthly_emi,Price
0,4+ BHK In Independent House For Sale In Raja...,"Independent House, 5th Block, near National Pu...",₹1.86 Lacs,"₹3.25 Crores₹10,833 per sq.ft."
1,4 BHK In Independent House For Sale In Jayan...,"Independent House, Jayanagar SBI Branch 9th bl...",₹1.55 Lacs,"₹2.7 Crores₹10,800 per sq.ft."
2,3 BHK Flat For Sale In Shree Rameshwara Nila...,manjunath road near The illusion Cafe,"₹63,045","₹1.1 Crores₹9,167 per sq.ft."
3,3 BHK Apartment For Sale In Laa Royal Manor ...,"Laa Royal Manor 11th Cross Rd, 8th cross, HAL...",₹1.58 Lacs,"₹2.75 Crores₹13,033 per sq.ft."
4,2 BHK Flat For Sale In Pallava Terrace In Ja...,"17, Pallava Terrace, North Main Road, 6th Bloc...","₹42,985","₹75 Lacs₹7,042 per sq.ft."
5,4+ BHK In Independent House For Sale In Raja...,"Independent House, 6th Cross road,9th main ro...","₹63,045","₹1.1 Crores₹8,333 per sq.ft."
6,"3 BHK Apartment For Sale In Admiralty Manor,...","Admiralty Manor, Indiranagar Admiralty Manor,...","₹85,971","₹1.5 Crores₹7,653 per sq.ft."
7,2 BHK Apartment For Sale In Jains Prakriti I...,"Jains Prakriti Kanakapura Rd, 7th Block West...",₹1.15 Lacs,"₹2 Crores₹15,408 per sq.ft."
8,3 BHK Flat For Sale In Benaka Apartments In ...,"16th D main, HAL 2nd stage, Indiranagar , Ben...","₹48,717","₹85 Lacs₹6,386 per sq.ft."
9,4 BHK In Independent House For Sale In Indir...,"Independent House, 2nd stage ,9th cross",₹1.69 Lacs,"₹2.95 Crores₹11,569 per sq.ft."
10,4+ BHK In Independent House For Sale In Laks...,"Independent House, CMH Rd , Near B P Bakery","₹63,045","₹1.1 Crores₹4,889 per sq.ft."
11,4+ BHK In Independent House For Sale In Raja...,"Independent House, 6th C cross 3rd main rd nea...","₹77,374","₹1.35 Crores₹6,136 per sq.ft."
12,2 BHK Apartment For Sale In Tarang Parkway A...,"Tarang Parkway Apartment 2nd Main Rd, Shivana...","₹57,314","₹1 Crore₹8,333 per sq.ft."
13,3 BHK Apartment For Sale In Brigade Gateway ...,"Brigade Gateway Dr Rajkumar Road, Rajaji Naga...",₹1.5 Lacs,"₹2.62 Crores₹16,000 per sq.ft."
14,"2 BHK Flat For Sale In Jains Prakruti, Jayan...","Kanakapura Road, Jayanagar, Bangalore, Karnata...","₹85,971","₹1.5 Crores₹11,530 per sq.ft."
15,4+ BHK In Independent House For Sale In Raja...,"Independent House, 6th Cross Rd, 2nd Block ne...","₹83,679","₹1.46 Crores₹6,518 per sq.ft."
16,3 BHK Flat For Sale In Rajaji Nagar,"Independent House, 242, 27th cross, 2nd Block,...","₹77,374","₹1.35 Crores₹10,588 per sq.ft."
17,2 BHK Apartment For Sale In Blueberry Apartm...,"Blueberry Apartment 13th E Main Rd, Channakes...","₹87,691","₹1.53 Crores₹14,246 per sq.ft."
18,3 BHK Apartment For Sale In Adarsh Court Apa...,Adarsh Court Apartment Adarsh Court Apartment...,₹1.86 Lacs,"₹3.25 Crores₹16,332 per sq.ft."
19,3 BHK Apartment For Sale In Parasmani Regenc...,"Parasmani Regency Parasmani Regency, 8th Cros...",₹1.43 Lacs,"₹2.5 Crores₹12,887 per sq.ft."
20,2 BHK Flat For Sale In Kumar Ashraya Apartme...,"Kumar Ashraya Apartments 194, 9th Cross Rd 2n...","₹37,827","₹66 Lacs₹7,333 per sq.ft."
21,3 BHK Apartment For Sale In Mayitri Enclave ...,"Mayitri Enclave Mayitri Enclave, 39th C, 5T B...","₹44,705","₹78 Lacs₹5,379 per sq.ft."
22,2 BHK Flat For Sale In Jayanagar Residency I...,"Jayanagar Residency, K V Layout, LIC Colony, J...","₹57,314","₹1 Crore₹8,333 per sq.ft."
23,4 BHK Flat For Sale In Rrbc Piccassso In Jay...,"Municipal No.152, 18th main road, beside Sai B...",₹3.91 Lacs,"₹6.83 Crores₹14,056 per sq.ft."
24,4 BHK Flat For Sale In Phoenix One Bangalor...,"Dr Rajkumar Rd, opposite Sheraton Hotel, Rajaj...",₹2.72 Lacs,"₹4.75 Crores₹16,374 per sq.ft."

# Dineout.co.in

In [124]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [125]:
#get request from source page
page = requests.get('https://www.dineout.co.in/delhi-restaurants/buffet-special')
page

In [126]:
#page content
soup = BeautifulSoup(page.content)

In [127]:
#scraping restaurant names
name = []
#append name to list
for i in soup.find_all('a',class_="restnt-name ellipsis"):
    name.append(i.text)

In [128]:
#scraping cusine
cusine = []
#append cusine to list
for i in soup.find_all('span',class_="double-line-ellipsis"):
    cusine.append(i.text)

In [129]:
#scrping location
location = []
#append location to list
for i in soup.find_all('div',class_="restnt-loc ellipsis"):
    location.append(i.text)

In [130]:
#scraping ratings
rating = []
#append rating to list
for i in soup.find_all('div',class_="restnt-rating rating-4"):
    rating.append(i.text)

In [131]:
#scraping image url
image = []
#append image_url to list
for i in soup.find_all('img',class_="no-img"):
    image.append(i['data-src'])

In [132]:
#Making DataFrame
import pandas as pd
df = pd.DataFrame({'Name':name,'Location':location,'Prices&Cusine':cusine,'Rating':rating,'Image_url':'images'})
df

,Name,Location,Prices&Cusine,Rating,Image_url
0,Castle Barbeque,"Connaught Place, Central Delhi","₹ 2,000 for 2 (approx) | North Indian, Chinese",3.5,images
1,Jungle Jamboree,"3CS Mall,Lajpat Nagar - 3, South Delhi","₹ 1,400 for 2 (approx) | North Indian, Asian, ...",3.9,images
2,Castle Barbeque,"Pacific Mall,Tagore Garden, West Delhi","₹ 2,000 for 2 (approx) | Chinese, North Indian",3.9,images
3,Cafe Knosh,"The Leela Ambience Convention Hotel,Shahdara, ...","₹ 3,000 for 2 (approx) | Italian, Continental",4.3,images
4,The Barbeque Company,"Gardens Galleria,Sector 38A, Noida","₹ 1,700 for 2 (approx) | North Indian, Chinese",4,images
5,India Grill,"Hilton Garden Inn,Saket, South Delhi","₹ 2,400 for 2 (approx) | North Indian, Italian",3.9,images
6,Delhi Barbeque,"Taurus Sarovar Portico,Mahipalpur, South Delhi","₹ 1,800 for 2 (approx) | North Indian",3.7,images
7,The Monarch - Bar Be Que Village,"Indirapuram Habitat Centre,Indirapuram, Ghaziabad","₹ 1,900 for 2 (approx) | North Indian",3.8,images
8,World Cafe,"Vibe by The Lalit Traveller,Sector 35, Faridabad","₹ 2,400 for 2 (approx) | North Indian, Italian",4.2,images
9,Indian Grill Room,"Suncity Business Tower,Golf Course Road, Gurgaon","₹ 2,200 for 2 (approx) | North Indian, Mughlai",4.3,images
10,Mad 4 Bar B Que,"Sector 29, Faridabad",₹ 800 for 2 (approx) | North Indian,3.6,images
11,Barbeque 29,"NIT, Faridabad","₹ 1,500 for 2 (approx) | North Indian, Mughlai...",4.2,images
12,Glasshouse,"DoubleTree By Hilton Gurugram Baani Square,Sec...","₹ 3,400 for 2 (approx) | European, Italian, As...",4,images

# Bewakoof- women's t-shirt

In [133]:
#import libraries
from bs4 import BeautifulSoup
import requests

In [134]:
#get request from source page
page = requests.get('https://www.bewakoof.com/women-t-shirts')
page

In [135]:
#page content
soup = BeautifulSoup(page.content)

In [136]:
#Scraping first 10 product name
product = []
#append product_name to list
for i in soup.find_all('h3')[:10]:
    product.append(i.text)

In [137]:
price = []
#append price to list
for i in soup.find_all('span',class_="discountedPriceText")[:10]:
    price.append(i.text.replace("₹",""))

In [138]:
image = []
#append image_url to list
for i in soup.find_all('a',class_="col-sm-4 col-xs-6")[:10]:
    image.append(i['href'])

In [139]:
#making DataFrame

import pandas as pd
df = pd.DataFrame({'product_name':product,'price':price,'image_url':image})
df

,product_name,price,image_url
0,Women's Pink Badass Graphic Printed Oversized ...,349,/p/badass-oversized-fit-t-shirt-women
1,Women's Green Badass Graphic Printed Oversized...,349,/p/badass-oversized-fit-t-shirt
2,Nir Vah Nuh Half Sleeve T-shirt,499,/p/nir-vah-nuh-half-sleeve-t-shirt-132
3,Not Gender Roles Boyfriend T-shirt,399,/p/not-gender-roles-boyfriend-t-shirt
4,Not Gender Roles Half Sleeve T-shirt,349,/p/not-gender-roles-half-sleeve-t-shirt
5,More Pizza Half Sleeve T-shirt,349,/p/more-pizza-half-sleeve-t-shirt
6,Mickey Silhoutte Half Sleeve T-shirt,349,/p/mickey-silhoutte-half-sleeve-t-shirt
7,Army Half Sleeve T-shirt,349,/p/army-half-sleeve-t-shirt
8,Garfield Squad Half Sleeve T-shirt,349,/p/garfield-squad-half-sleeve-t-shirt
9,Only Love Half Sleeve T-shirt,349,/p/only-love-half-sleeve-t-shirt